InformationRegisters/ПорядокЗакрытияБалансовыхСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПорядокЗакрытияБалансовыхСтатей</Name>
			<Comment>Порядок распределения статей доходов и расходов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок закрытия статьи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Статья</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПорядокЗакрытияБалансовыхСтатей/Ext/ManagerModule.bsl
// Модуль менеджера регистра "Порядок закрытия балансовых статей"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Заполняет начальными данными регистр "Порядок распределения статей доходов и расходов"
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	НастройкиПоУмолчанию = РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.ПолучитьМакет("НастройкиПоУмолчанию");
	
	НаборЗаписей = РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НастроенныеСтатьи = НаборЗаписей.ВыгрузитьКолонку("Статья");
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");

	Для НомерСтроки = 1 По НастройкиПоУмолчанию.ВысотаТаблицы Цикл
		
		Статья  = Справочники.СтатьиДоходовИРасходов[СокрЛП(НастройкиПоУмолчанию.Область(НомерСтроки, 1).Текст)];
		Порядок = ОписаниеТипаБулево.ПривестиЗначение(СокрЛП(НастройкиПоУмолчанию.Область(НомерСтроки, 2).Текст));
		
		Если НастроенныеСтатьи.Найти(Статья) = Неопределено Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Статья  = Статья;
			НоваяЗапись.Порядок = Порядок;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НаборЗаписей.Модифицированность() Тогда
		
		НаборЗаписей.Записать(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
